---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MechanicalSystemType
source: html/0016242c-2955-54a9-ff34-916634431d83.htm
---
# MechanicalSystemType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.